benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/tcpdump-benchmark-80.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  1 threads and 80 connections
  Thread calibration: mean lat.: 1.867ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.95ms    2.50ms  14.20ms   95.63%
    Req/Sec    84.05     94.82   400.00     81.11%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.49ms
 75.000%    1.65ms
 90.000%    1.87ms
 99.000%   14.20ms
 99.900%   30.24ms
 99.990%   44.96ms
 99.999%   44.96ms
100.000%   44.96ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.052     0.000000            1         1.00
       1.237     0.100000          397         1.11
       1.307     0.200000          795         1.25
       1.372     0.300000         1190         1.43
       1.435     0.400000         1587         1.67
       1.493     0.500000         1981         2.00
       1.529     0.550000         2177         2.22
       1.562     0.600000         2380         2.50
       1.589     0.650000         2575         2.86
       1.621     0.700000         2775         3.33
       1.653     0.750000         2969         4.00
       1.673     0.775000         3069         4.44
       1.694     0.800000         3168         5.00
       1.719     0.825000         3265         5.71
       1.749     0.850000         3365         6.67
       1.794     0.875000         3464         8.00
       1.824     0.887500         3512         8.89
       1.870     0.900000         3562        10.00
       1.945     0.912500         3611        11.43
       2.069     0.925000         3661        13.33
       2.515     0.937500         3710        16.00
       2.705     0.943750         3735        17.78
       3.035     0.950000         3761        20.00
       4.427     0.956250         3784        22.86
       5.579     0.962500         3810        26.67
       6.515     0.968750         3834        32.00
       7.839     0.971875         3846        35.56
       8.671     0.975000         3859        40.00
      10.063     0.978125         3871        45.71
      10.567     0.981250         3883        53.33
      12.071     0.984375         3896        64.00
      12.311     0.985938         3902        71.11
      12.975     0.987500         3908        80.00
      13.599     0.989062         3914        91.43
      14.695     0.990625         3920       106.67
      16.495     0.992188         3928       128.00
      17.135     0.992969         3930       142.22
      18.607     0.993750         3934       160.00
      18.703     0.994531         3936       182.86
      19.343     0.995313         3939       213.33
      19.839     0.996094         3942       256.00
      20.943     0.996484         3944       284.44
      21.567     0.996875         3945       320.00
      23.791     0.997266         3947       365.71
      23.839     0.997656         3948       426.67
      28.127     0.998047         3950       512.00
      29.151     0.998242         3951       568.89
      29.151     0.998437         3951       640.00
      29.487     0.998633         3952       731.43
      30.239     0.998828         3953       853.33
      31.679     0.999023         3954      1024.00
      31.679     0.999121         3954      1137.78
      31.679     0.999219         3954      1280.00
      35.775     0.999316         3955      1462.86
      35.775     0.999414         3955      1706.67
      37.759     0.999512         3956      2048.00
      37.759     0.999561         3956      2275.56
      37.759     0.999609         3956      2560.00
      37.759     0.999658         3956      2925.71
      37.759     0.999707         3956      3413.33
      44.959     0.999756         3957      4096.00
      44.959     1.000000         3957          inf
#[Mean    =        1.954, StdDeviation   =        2.502]
#[Max     =       44.928, Total count    =         3957]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4728 requests in 1.00m, 0.90MB read
  Socket errors: connect 0, read 0, write 0, timeout 323
Requests/sec:     78.79
Transfer/sec:     15.31KB